{
  "select_language": "Selecione um Idioma",
  "english": "Inglês",
  "portuguese": "Português",
  "welcome": "Bem-vindo ao meu portfólio",
  "home": "Início",
  "about": "Sobre Mim",
  "skills": "Habilidades",
  "experience": "Experiência",
  "projects": "Projetos",
  "projects_heading": "Trabalhos em destaque no comércio",
  "projects_intro": "Uma seleção de iniciativas de checkout que criei para serem rápidas, resilientes e alinhadas à marca.",
  "contact": "Contato",
  "about_me_p1": "Eu sou um cara APAIXONADO por filmes, séries, ficção científica, fantasia e tecnologia. O famoso NERD!",
  "about_me_p2": "Eu também sou um amante da COZINHA, gosto de cozinhar para meus amigos, aprender e sempre tentar coisas novas e divertidas.",
  "about_me_p3": "Recentemente, estou hiper focado no meu tempo pessoal em liberdade financeira, planejando e investindo a ponto de considerar a construção de meu próprio negócio no setor, possivelmente criando um aplicativo para ajudar as pessoas a alcançar seus objetivos de vida pessoal, organizando suas finanças e saindo das dívidas.",
  "contact_professional": "Consultas Profissionais",
  "contact_personal": "Pessoal",
  "contact_other": "Outros",
  "bold_commerce_duration": "6 anos 10 meses",
  "senior_software_developer_period": "Janeiro de 2022 - Presente",
  "winnipeg_mb_ca": "Winnipeg, Manitoba, Canadá",
  "sdd_desc_1": "Escrevendo componentes e lógica React.js em Javascript/Typescript.",
  "sdd_desc_2": "Implementando definições de tipo.",
  "sdd_desc_3": "Gerenciando pacotes NPM.",
  "sdd_desc_4": "Implementando e consumindo APIs Rest em PHP/Laravel.",
  "sdd_desc_5": "Escrevendo novos modelos de vitrine de checkout usando Typescript e React JS em comunicação com APIs Rest agnósticas de plataforma para capacitar parceiros e comerciantes com uma página de checkout mais flexível, independentemente das plataformas de comércio eletrônico, com a capacidade de personalizar para a necessidade individual do comerciante.",
  "js_sme_period": "Outubro de 2019 - Fevereiro de 2023",
  "js_sme_desc_1": "Respondendo a perguntas de desenvolvedores relacionadas a Javascript, Typescript e React JS.",
  "js_sme_desc_2": "Escrevendo padrões de código Javascript, Typescript e Frontend.",
  "js_sme_desc_3": "Escrevendo documentos de decisão envolvendo implementações de Frontend e Javascript.",
  "toastmaster_period": "Julho de 2021 - Junho de 2022",
  "intermediate_dev_period": "Janeiro de 2019 - Janeiro de 2022",
  "intermediate_dev_desc_1": "Escrevendo componentes React, Javascript, funções de utilitários Typescript e pacotes NPM internos.",
  "intermediate_dev_desc_2": "Implementando APIs Rest em PHP usando o framework Laravel.",
  "intermediate_dev_desc_3": "Implementando aplicativo para controlar pedidos e pagamentos, principalmente implementando a vitrine e o frontend de administração usando React.js.",
  "intermediate_dev_desc_4": "Implementando e mantendo a integração de vários gateways de pagamento no aplicativo Bold Checkout, como Stripe, Spreedly, CyberSource, Braintree, Paypal, AmazonPay e Flexiti.",
  "freelance_web_dev_period": "Outubro de 2018 - Janeiro de 2019",
  "curitiba_br": "Curitiba e Região, Brasil",
  "freelance_web_dev_desc_1": "Escrevendo código usando PHP e Delphi para adicionar recursos e manter o sistema de integração de pagamento da web usado na página da empresa de ônibus e nas máquinas de autoatendimento de passagens de ônibus na estação de ônibus interestadual.",
  "freelance_web_dev_desc_2": "Atualizando, validando e certificando a integração com o Gateway de Pagamento Brasileiro REDE.",
  "greca_period": "Fevereiro de 2012 - Outubro de 2018",
  "greca_desc_1": "Desenvolveu e gerenciou a melhoria do sistema e os custos de desenvolvimento.",
  "greca_desc_2": "Liderou a equipe de terceiros responsável pela correção dos erros do sistema e coordenou a migração e integração de sistemas.",
  "greca_desc_3": "Desenvolveu o cálculo do sistema de folha de pagamento na linguagem proprietária da TOTVS com base em VB.Net e implementou e desenvolveu a integração de sistemas usando a linguagem proprietária da TOTVS com base em Clipper.",
  "greca_desc_4": "Desenvolveu o serviço Web JavaScript e SOAP com Php para integração entre o sistema de Help Desk e a Interface Web do Firewall.",
  "greca_desc_5": "Desenvolveu páginas da Intranet usando Joomla CMS, Php, Html e CSS.",
  "greca_desc_6": "Extraiu dados para relatórios e ferramentas de BI, usando consultas SQL.",
  "freelance_android_dev_period": "Outubro de 2015 - Outubro de 2016",
  "freelance_android_dev_desc_1": "Desenvolveu um aplicativo Android para uma casa de software em Java e linguagem Pascal, que abriu a casa de software para o mercado móvel e melhorou seus principais recursos de software.",
  "xtreme_period": "Outubro de 2004 - Dezembro de 2011",
  "santa_rosa_rs_br": "Santa Rosa, RS, Brasil",
  "xtreme_desc_1": "Responsável pela gestão da empresa, atendimento ao cliente, help desk de técnico de informática, manutenção de hardware, instalação e configuração de servidores Windows e Linux, manutenção de rede de computadores do cliente e manutenção de rede de computadores local, manutenção de servidores virtuais na plataforma XenServer.",
  "xtreme_desc_2": "Desenvolveu scripts Batch e Shell para instalação e configuração de sistemas operacionais de servidores.",
  "teacher_period": "Outubro de 2011 - Novembro de 2011",
  "teacher_desc_1": "Ministrou aulas básicas de informática para alunos do 5º ao 8º ano do ensino fundamental e médio através do Projeto Brasileiro \"Mais Educação\".",
  "hipernet_period": "Novembro de 2009 - Maio de 2010",
  "hipernet_desc_1": "Responsável pelo atendimento ao cliente, help desk de técnico de informática, manutenção de hardware, instalação e configuração de servidores Windows e Linux, manutenção de rede de computadores do cliente e manutenção de rede de computadores local, manutenção de servidores virtuais na plataforma XenServer.",
  "industry_knowledge": "Conhecimento da Indústria",
  "tools_technologies": "Ferramentas e Tecnologias",
  "interpersonal_skills": "Habilidades Interpessoais",
  "languages": "Idiomas",
  "checkout_templates_desc": "Frontend para o aplicativo Bold Commerce Checkout.",
  "payment_booster_desc": "Módulo da plataforma Adobe Commerce (Magento 2).",
  "galapagos_desc": "Uma migração de sistema ERP para a Greca Asfaltos, onde coordenei transformações de dados, personalizações e processos.",
  "eps_desc": "Implementação da plataforma PayPal Complete, Braintree e Stripe com seus respectivos botões de pagamento (PayPal, PayLater, Venmo, Apple Pay, Google Pay).",
  "bold_checkout_desc": "Integra EPS, Booster e modelos de experiência.",
  "agentic_checkout_desc": "Trabalhando na vanguarda da tecnologia de Agentes de IA para compras online, implementando os protocolos mais recentes e ajudando a moldar o futuro do comércio agentico.",
  "home_subtitle": "Desenvolvedor React | Construindo Experiências Web Interativas com JavaScript & TypeScript",
  "home_title": "Criando jornadas de checkout elegantes para marcas ambiciosas.",
  "home_description": "Sou Felipe, desenvolvedor de software sênior obcecado por performance, acessibilidade e experiências de comércio resilientes que encantam lojistas e clientes.",
  "home_status_badge": "Disponível para colaboração",
  "home_primary_cta": "Explore meus projetos",
  "home_secondary_cta": "Vamos colaborar",
  "home_chip_checkout": "Sistemas de checkout",
  "home_chip_performance": "Performance em primeiro lugar",
  "home_chip_payments": "Integrações de pagamento",
  "home_metric_years_label": "anos construindo produtos digitais",
  "home_metric_projects_label": "projetos de comércio lançados",
  "home_metric_mentoring_label": "equipes mentoradas e lideradas",
  "home_metric_caption": "Instantâneo de impacto",
  "home_highlight_caption": "Entrega",
  "home_highlight_conversion": "ganho de conversão em redesigns",
  "home_highlight_response": "tempos de resposta sob pico de carga",
  "home_hero_alt": "Ilustração placeholder do retrato de Felipe dos Santos",
  "footer_text": "© 2024 Felipe dos Santos. Todos os direitos reservados.",
  "learn_more": "Saiba Mais"
}
